app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "published_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Rosendo's life"], ["author", "rosendo"], ["published_date", "2022-02-03"], ["created_at", "2022-02-03 03:10:15.229379"], ["updated_at", "2022-02-03 03:10:15.229379"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "price" = $1, "published_date" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["price", "420.69"], ["published_date", "2022-02-01"], ["updated_at", "2022-02-03 03:10:22.011288"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)